USE DreamHome
GO

CREATE TABLE OWNER
(Owner_no member_no IDENTITY(1,1)  NOT NULL,
FName shortstring NOT NULL,
LName shortstring NOT NULL,
City shortstring NOT NULL,
Street shortstring NOT NULL,
House nchar(6) NOT NULL,
Flat smallint NULL,
Otel_no phonenumber NULL)
GO


INSERT INTO OWNER(FName, LName, City, Street, House, Flat, Otel_no) VALUES
('Жерносек', 'Юрий', 'Витебск', 'Терешковой', '28/1', '7', '62-07-94'),
('Панкратова', 'Инна', 'Новополоцк', 'Парковая', '2б', '12', '57-12-48'), 
('Амбражевич', 'Сергей', 'Новополоцк', 'Двинская', '5', '18', '52-14-89'),
('Поскрёбышева', 'Елена', 'Витебск', 'П.Бровки', '26/1', '40', '23-00-72(аб978)'), 
('Титов', 'Николай', 'Витебск', 'Интернационалистов', '35', '187', '8(029)633-76-68'),
('Скребкова', 'Алла', 'Новополоцк', 'Молодёжная', '1', '22', '8(029)688-84-46'),
('Николаев', 'Влад', 'Витебск', 'Фрунзе', '33', '214', '8(029)673-07-30'),
('Цалко', 'Сергей', 'Лепель', 'Ленина', '14/2', '4', '25-17-90'),
('Цыркунова', 'Наталья', 'Россоны', 'Цветочная', '90', '15', '26-32-48'),
('Яковлев', 'Андрей', 'Витебск', 'Лазо', '65', NULL, '21-72-25')
GO

INSERT INTO BUYER(FName, LName, City, Street, House, Flat, Htel_no, Wtel_no, Prof_Rooms, Max_Price, Branch_no) VALUES
('Невердасов', 'Виктор', 'Витебск', 'Московский пр-т', '16/4', '117', '62-08-19', '36-40-80', '2', '110000', '2'),
('Кассап', 'Светлана', 'Новополоцк', 'Гайдара', '17а', '4', '57-12-48', NULL, '1', '78000', '3'), 
('Орлов', 'Александр', 'Минск', 'Либнехта', '93', '15', '8(017)286-13-21', NULL, '3', '14500', '1'),
('Сафронова', 'Светлана', 'Витебск', 'пр-т Победы', '3/1', '324', '8(029)661-07-30', '22-67-94', '2', '60000', '4'),
('Окорков', 'Вадим', 'Минск', 'Лермонтова', '35', '187', NULL, '8(017)224-84-24', '5', '300000', '1'),
('Семёнов', 'Вячеслав', 'Витебск', 'Замковая', '4', '13', '23-00-72(аб964)', NULL, '2', '10500', '1'),
('Краснова', 'Жанна', 'Витебск', 'Клиническая', '104', NULL, NULL, '23-50-70', '1', '90000', '2'),
('Будда', 'Елена', 'Лепель', 'Ленина', '3', '5', '25-17-90', NULL, '4', '200000', '3'),
('Боровая', 'Наталья', 'Орша', 'Смоленская', '12/4', '26', '26-32-48', NULL, '2', '140000', '2'),
('Алипов', 'Игорь', 'Витебск', 'Московский пр-т', '22', '4', '21-72-25', NULL, '3', '150000', '2')
GO

ALTER TABLE BUYER
ADD Buyer_no member_no IDENTITY(1, 1) PRIMARY KEY
GO

ALTER TABLE PROPERTY
ADD Property_no member_no IDENTITY(3000, 1) PRIMARY KEY
GO

INSERT INTO VIEWING (Date_View, Comments, Property_no, Buyer_no) VALUES
('19.10.16',	'согласен',	3002,	1),
('17.10.16',	'согласен',	3003,	1),
('18.11.16',	'не согласен',	3002,	4),
('19.10.16',	'согласен',	3005,	2),
('25.10.16',	'требует ремонта',	3001,	7)
GO

INSERT INTO PROPERTY (Data_registration, Postcode, City, Street, House, Flat, Floor_Type, Floor, 
Rooms, The_area, Balcony, Ptel, Selling_Price, Branch_no, Staff_no, Owner_no) VALUES
('16.10.16', '210033', 'Витебск', 'Смоленская', '11', '57', '5П', '3', '1', '31/18/10', 'Б', 'T', '60000', '1', '3', '1'), 
('17.10.15', '210035', 'Витебск', 'Бровки', '11', '49', '9К', '9', '1', '37/21/7', 'Бз', NULL, '70000', '2', '3', '5'), 
('18.10.16', '210029', 'Витебск', 'Строителей', '23/2', '214', '12П', '2', '2', '81/29/9', 'Лз', 'T', '92000', '2', '7', '7'), 
('19.09.16', '210005', 'Витебск', 'Лазо', '11', '4', '3К', '3', '2', '65/40/7,6', '2Бз', NULL, '15000', '1', '2', '5'),
('15.08.16', '211460', 'Россоны', 'Ленина', '32', '20', '5П', '5', '3', '68,4/44,3/9,81', '2Бз', 'T', '100000', '4', '9', '7'), 
('11.09.16', '211440', 'Новопол', 'Школьная', '11', '56', '9П', '3', '1', '36/18/8,2', 'Б', 'T', '75000', '3', '1', '6'), 
('14.11.16', '211440', 'Новопол', 'Молодёжная', '5', '14', '9П', '2', '2', '46/27/6,8', 'Лз', 'T', '60000', '3', '5', '3'),
('20.10.16', '211180', 'Полоцк', 'Вокзальная', '8', '15', '5К', '5', '3', '65/38/7', 'Б', 'T', '80000', '3', '8', '2'), 
('16.09.16', '211460', 'Россоны', 'Советская', '17', '1', '5К', '1', '3', '65/38/7', NULL, 'T', '47500', '4', '9', '7')
GO

INSERT INTO STAFF(FName, LName, DOB, Sex, City, Street, House, Flat, Stel_no, Date_Joined, Position, Salary, Branch_no) VALUES
('Батуркин', 'Александр', '17.10.68', 'М', 'Новополоцк', 'Парковая', '5', '13', '23-79-77', '1.01.2001', 'менеджер', '2500000', '3'),
('Чубаро', 'Наталья', '25.05.72', 'Ж', 'Витебск', 'Чкалова', '21/1', '12', '8(029)662-47-32', '10.02.2002', 'торговый агент', '1800000', '1'),
('Коваленко', 'Светлана', '1.02.70', 'Ж', 'Витебск', 'Чкалова', '24', '49', '62-51-23', '15.01.2001', 'менеджер', '2500000', '3'),
('Логинов', 'Вадим', '9.09.67', 'м', 'Витебск', 'Чкалова', '41/2', '96', '23-06-73', '2.09.1999', 'директор', '3000000', '1'),
('Суворов', 'Виталий', '11.07.65', 'М', 'Новополоцк', 'Школьная', '47/1', '157', '22-29-03', '1.02.1999', 'торговый агент', '1800000', '3'),
('Жарков', 'Герман', '6.03.68', 'М', 'Витебск', 'Гагарина', '31', '28', '63-43-98', '2.10.2001', 'менеджер', '2800000', '2'),
('Ганущенко', 'Галина', '5.11.69', 'ж', 'Витебск', 'Лазо', '90/1', '54', '62-43-64', '3.11.2004', 'курьер', '1800000', '2'),
('Сотникова', 'Ольга', '7.12.67', 'Ж', 'Полоцк', 'Вокзальная', '7', NULL, NULL, '2.02.2002', 'маклер', '1000000', '3'),
('Янчиленко', 'Сергей', '28.02.70', 'М', 'Россоны', 'Ленина', '28/2', '25', NULL, '17.05.2005', 'торговый агент', '1500000', '4')
GO

ALTER TABLE STAFF
ALTER COLUMN Stel_no Phonenumber NULL
GO

DELETE FROM STAFF
GO